lwfinger/rtl8723du/hal/usb_halinit.c
// SPDX-License-Identifier: GPL-2.0
/* Copyright(c) 2007 - 2017 Realtek Corporation */

#define _USB_HALINIT_C_

#include <rtl8723d_hal.h>

static void _dbg_dump_macreg(struct adapter * adapt)
{
	u32 offset = 0;
	u32 val32 = 0;
	u32 index = 0;

	for (index = 0; index < 64; index++) {
		offset = index * 4;
		val32 = rtw_read32(adapt, offset);
		RTW_INFO("offset : 0x%02x ,val:0x%08x\n", offset, val32);
	}
}

static void
_ConfigChipOutEP_8723(
	struct adapter * adapt,
	u8 NumOutPipe
)
{
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);

	pHalData->OutEpQueueSel = 0;
	pHalData->OutEpNumber = 0;

	switch (NumOutPipe) {
	case 4:
		pHalData->OutEpQueueSel = TX_SELE_HQ | TX_SELE_LQ | TX_SELE_NQ;
		pHalData->OutEpNumber = 4;
		break;
	case 3:
		pHalData->OutEpQueueSel = TX_SELE_HQ | TX_SELE_LQ | TX_SELE_NQ;
		pHalData->OutEpNumber = 3;
		break;
	case 2:
		pHalData->OutEpQueueSel = TX_SELE_HQ | TX_SELE_NQ;
		pHalData->OutEpNumber = 2;
		break;
	case 1:
		pHalData->OutEpQueueSel = TX_SELE_HQ;
		pHalData->OutEpNumber = 1;
		break;
	default:
		break;
	}
}

static bool HalUsbSetQueuePipeMapping8723DUsb(
	struct adapter * adapt,
	u8 NumInPipe,
	u8 NumOutPipe
)
{
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);
	bool result = false;

	_ConfigChipOutEP_8723(adapt, NumOutPipe);

	result = Hal_MappingOutPipe(adapt, NumOutPipe);

	RTW_INFO("USB NumInPipe(%u), NumOutPipe(%u/%u)\n"
		 , NumInPipe
		 , pHalData->OutEpNumber
		 , NumOutPipe);

	return result;
}

static void rtl8723du_interface_configure(
	struct adapter * adapt
)
{
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);
	struct dvobj_priv *pdvobjpriv = adapter_to_dvobj(adapt);

	if (IS_HIGH_SPEED_USB(adapt)) {
		/* HIGH SPEED */
		pHalData->UsbBulkOutSize = USB_HIGH_SPEED_BULK_SIZE; /* 512 bytes */
	} else {
		/* FULL SPEED */
		pHalData->UsbBulkOutSize = USB_FULL_SPEED_BULK_SIZE; /* 64 bytes */
	}

	pHalData->interfaceIndex = pdvobjpriv->InterfaceNumber;

	HalUsbSetQueuePipeMapping8723DUsb(adapt,
			  pdvobjpriv->RtNumInPipes, pdvobjpriv->RtNumOutPipes);
}

static u32 _InitPowerOn_8723du(struct adapter * adapt)
{
	u32 status = _SUCCESS;
	u32 value32 = 0;
	u16 value16 = 0;
	u8 value8 = 0;

	rtw_hal_get_hwreg(adapt, HW_VAR_APFM_ON_MAC, &value8);
	if (value8)
		return _SUCCESS;
	/* HW Power on sequence */
	if (!HalPwrSeqCmdParsing(adapt, PWR_CUT_ALL_MSK, PWR_FAB_ALL_MSK, PWR_INTF_USB_MSK, rtl8723D_card_enable_flow))
		return _FAIL;

	/* Enable MAC DMA/WMAC/SCHEDULE/SEC block */
	/* Set CR bit10 to enable 32k calibration. Suggested by SD1 Gimmy. Added by tynli. 2011.08.31. */
	rtw_write16(adapt, REG_CR, 0x00);  /* suggseted by zhouzhou, by page, 20111230 */

	value16 = rtw_read16(adapt, REG_CR);
	value16 |= (HCI_TXDMA_EN | HCI_RXDMA_EN | TXDMA_EN | RXDMA_EN
		    | PROTOCOL_EN | SCHEDULE_EN | ENSEC | CALTMR_EN);
	rtw_write16(adapt, REG_CR, value16);

	value8 = true;
	rtw_hal_set_hwreg(adapt, HW_VAR_APFM_ON_MAC, &value8);

	return status;
}

/*
 * -------------------------------------------------------------------------
 * LLT R/W/Init function
 * -------------------------------------------------------------------------
 */
static u8 _LLTWrite(
	struct adapter * adapt,
	u32 address,
	u32 data
)
{
	u8 status = _SUCCESS;
	s8 count = POLLING_LLT_THRESHOLD;
	u32 value = _LLT_INIT_ADDR(address) | _LLT_INIT_DATA(data) | _LLT_OP(_LLT_WRITE_ACCESS);

	rtw_write32(adapt, REG_LLT_INIT, value);

	/* polling */
	do {
		value = rtw_read32(adapt, REG_LLT_INIT);
		if (_LLT_NO_ACTIVE == _LLT_OP_VALUE(value))
			break;
	} while (--count);

	if (count <= 0) {
		RTW_INFO("Failed to polling write LLT done at address %d!\n", address);
		status = _FAIL;
	}
	return status;
}

static u8 _LLTRead(
	struct adapter * adapt,
	u32 address
)
{
	int count = 0;
	u32 value = _LLT_INIT_ADDR(address) | _LLT_OP(_LLT_READ_ACCESS);

	rtw_write32(adapt, REG_LLT_INIT, value);

	/* polling and get value */
	do {
		value = rtw_read32(adapt, REG_LLT_INIT);
		if (_LLT_NO_ACTIVE == _LLT_OP_VALUE(value))
			return (u8)value;

		if (count > POLLING_LLT_THRESHOLD) {
			break;
		}
	} while (count++);

	return 0xFF;
}


/*
 * ---------------------------------------------------------------
 * MAC init functions
 * ---------------------------------------------------------------
 */

/*
 * USB has no hardware interrupt,
 * so no need to initialize HIMR.
 */
static void _InitInterrupt(struct adapter * adapt)
{
}

static void _InitQueueReservedPage(struct adapter * adapt)
{
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);
	struct registry_priv *pregistrypriv = &adapt->registrypriv;
	u32 outEPNum = (u32)pHalData->OutEpNumber;
	u32 numHQ = 0;
	u32 numLQ = 0;
	u32 numNQ = 0;
	u32 numPubQ;
	u32 value32;
	u8 value8;
	bool bWiFiConfig = pregistrypriv->wifi_spec;

	if (pHalData->OutEpQueueSel & TX_SELE_HQ)
		numHQ = bWiFiConfig ? WMM_NORMAL_PAGE_NUM_HPQ_8723D : NORMAL_PAGE_NUM_HPQ_8723D;

	if (pHalData->OutEpQueueSel & TX_SELE_LQ)
		numLQ = bWiFiConfig ? WMM_NORMAL_PAGE_NUM_LPQ_8723D : NORMAL_PAGE_NUM_LPQ_8723D;

	/* NOTE: This step shall be proceed before writing REG_RQPN. */
	if (pHalData->OutEpQueueSel & TX_SELE_NQ)
		numNQ = bWiFiConfig ? WMM_NORMAL_PAGE_NUM_NPQ_8723D : NORMAL_PAGE_NUM_NPQ_8723D;
	value8 = (u8)_NPQ(numNQ);
	rtw_write8(adapt, REG_RQPN_NPQ, value8);

	numPubQ = TX_TOTAL_PAGE_NUMBER_8723D - numHQ - numLQ - numNQ;

	/* TX DMA */
	value32 = _HPQ(numHQ) | _LPQ(numLQ) | _PUBQ(numPubQ) | LD_RQPN;
	rtw_write32(adapt, REG_RQPN, value32);

}

static void _InitTRxBufferBoundary(struct adapter * adapt)
{
	struct registry_priv *pregistrypriv = &adapt->registrypriv;
#ifdef CONFIG_CONCURRENT_MODE
	u8 val8;
#endif /* CONFIG_CONCURRENT_MODE */

	/* u16	txdmactrl; */
	u8 txpktbuf_bndy;

	if (!pregistrypriv->wifi_spec)
		txpktbuf_bndy = TX_PAGE_BOUNDARY_8723D;
	else {
		/* for WMM */
		txpktbuf_bndy = WMM_NORMAL_TX_PAGE_BOUNDARY_8723D;
	}

	rtw_write8(adapt, REG_TXPKTBUF_BCNQ_BDNY_8723D, txpktbuf_bndy);
	rtw_write8(adapt, REG_TXPKTBUF_MGQ_BDNY_8723D, txpktbuf_bndy);
	rtw_write8(adapt, REG_TXPKTBUF_WMAC_LBK_BF_HD_8723D, txpktbuf_bndy);
	rtw_write8(adapt, REG_TRXFF_BNDY, txpktbuf_bndy);
	rtw_write8(adapt, REG_TDECTRL + 1, txpktbuf_bndy);

