lwfinger/rtl8723du/hal/usb_halinit.c
	/* RX Page Boundary */
	rtw_write16(adapt, REG_TRXFF_BNDY + 2, RX_DMA_BOUNDARY_8723D);

#ifdef CONFIG_CONCURRENT_MODE
	val8 = txpktbuf_bndy + 8;
	rtw_write8(adapt, REG_BCNQ1_BDNY, val8);
	rtw_write8(adapt, REG_DWBCN1_CTRL_8723D + 1, val8); /* BCN1_HEAD */

	val8 = rtw_read8(adapt, REG_DWBCN1_CTRL_8723D + 2);
	val8 |= BIT(1); /* BIT1- BIT_SW_BCN_SEL_EN */
	rtw_write8(adapt, REG_DWBCN1_CTRL_8723D + 2, val8);
#endif /* CONFIG_CONCURRENT_MODE */
}


static void
_InitTransferPageSize_8723du(
	struct adapter * adapt
)
{

	u8 value8;

	value8 = _PSRX(PBP_256) | _PSTX(PBP_256);

	rtw_write8(adapt, REG_PBP, value8);
}


static void
_InitNormalChipRegPriority(
	struct adapter * adapt,
	u16 beQ,
	u16 bkQ,
	u16 viQ,
	u16 voQ,
	u16 mgtQ,
	u16 hiQ
)
{
	u16 value16 = (rtw_read16(adapt, REG_TRXDMA_CTRL) & 0x7);

	value16 |= _TXDMA_BEQ_MAP(beQ) | _TXDMA_BKQ_MAP(bkQ) |
		   _TXDMA_VIQ_MAP(viQ) | _TXDMA_VOQ_MAP(voQ) |
		   _TXDMA_MGQ_MAP(mgtQ) | _TXDMA_HIQ_MAP(hiQ);

	rtw_write16(adapt, REG_TRXDMA_CTRL, value16);
}


static void
_InitNormalChipTwoOutEpPriority(
	struct adapter * adapt
)
{
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);
	struct registry_priv *pregistrypriv = &adapt->registrypriv;
	u16 beQ, bkQ, viQ, voQ, mgtQ, hiQ;

	u16 valueHi = 0;
	u16 valueLow = 0;

	switch (pHalData->OutEpQueueSel) {
	case (TX_SELE_HQ | TX_SELE_LQ):
		valueHi = QUEUE_HIGH;
		valueLow = QUEUE_LOW;
		break;
	case (TX_SELE_NQ | TX_SELE_LQ):
		valueHi = QUEUE_NORMAL;
		valueLow = QUEUE_LOW;
		break;
	case (TX_SELE_HQ | TX_SELE_NQ):
		valueHi = QUEUE_HIGH;
		valueLow = QUEUE_NORMAL;
		break;
	default:
		/* RT_ASSERT(false,("Shall not reach here!\n")); */
		break;
	}
	if (!pregistrypriv->wifi_spec) {
		beQ = valueLow;
		bkQ = valueLow;
		viQ = valueHi;
		voQ = valueHi;
		mgtQ = valueHi;
		hiQ = valueHi;
	} else { /* for WMM */
		beQ = valueLow;
		bkQ = valueHi;
		viQ = valueHi;
		voQ = valueLow;
		mgtQ = valueHi;
		hiQ = valueHi;
	}

	_InitNormalChipRegPriority(adapt, beQ, bkQ, viQ, voQ, mgtQ, hiQ);
}

static void
_InitNormalChipThreeOutEpPriority(
	struct adapter * adapt
)
{
	struct registry_priv *pregistrypriv = &adapt->registrypriv;
	u16 beQ, bkQ, viQ, voQ, mgtQ, hiQ;

	if (!pregistrypriv->wifi_spec) { /* typical setting */
		beQ = QUEUE_LOW;
		bkQ = QUEUE_LOW;
		viQ = QUEUE_NORMAL;
		voQ = QUEUE_HIGH;
		mgtQ = QUEUE_HIGH;
		hiQ = QUEUE_HIGH;
	} else { /* for WMM */
		beQ = QUEUE_LOW;
		bkQ = QUEUE_NORMAL;
		viQ = QUEUE_NORMAL;
		voQ = QUEUE_HIGH;
		mgtQ = QUEUE_HIGH;
		hiQ = QUEUE_HIGH;
	}
	_InitNormalChipRegPriority(adapt, beQ, bkQ, viQ, voQ, mgtQ, hiQ);
}

static void _InitQueuePriority(struct adapter * adapt)
{
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);

	switch (pHalData->OutEpNumber) {
	case 2:
		_InitNormalChipTwoOutEpPriority(adapt);
		break;
	case 3:
	case 4:
		_InitNormalChipThreeOutEpPriority(adapt);
		break;
	default:
		/* RT_ASSERT(false,("Shall not reach here!\n")); */
		break;
	}

}

static void
_InitHardwareDropIncorrectBulkOut(
	struct adapter * adapt
)
{
	u32 value32 = rtw_read32(adapt, REG_TXDMA_OFFSET_CHK);

	value32 |= DROP_DATA_EN;

	rtw_write32(adapt, REG_TXDMA_OFFSET_CHK, value32);
}

static void
_InitNetworkType(
	struct adapter * adapt
)
{
	u32 value32;

	value32 = rtw_read32(adapt, REG_CR);

	/* TODO: use the other function to set network type */
	value32 = (value32 & ~MASK_NETTYPE) | _NETTYPE(NT_LINK_AP);
	rtw_write32(adapt, REG_CR, value32);
}

static void
_InitDriverInfoSize(
	struct adapter * adapt,
	u8 drvInfoSize
)
{
	u8 value8;

	/* BIT_DRVINFO_SZ [3:0] */
	value8 = rtw_read8(adapt, REG_RX_DRVINFO_SZ) & 0xF8;
	value8 |= drvInfoSize;
	rtw_write8(adapt, REG_RX_DRVINFO_SZ, value8);
}

static void
_InitWMACSetting(
	struct adapter * adapt
)
{
	u16 value16;
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);
	u32 rcr;

	rcr = RCR_APM | RCR_AM | RCR_AB | RCR_CBSSID_DATA | RCR_CBSSID_BCN | RCR_APP_ICV | RCR_AMF | RCR_HTC_LOC_CTRL | RCR_APP_MIC | RCR_APP_PHYST_RXFF;
	rtw_hal_set_hwreg(adapt, HW_VAR_RCR, (u8 *)&rcr);

	/* Accept all data frames */
	value16 = 0xFFFF;
	rtw_write16(adapt, REG_RXFLTMAP2_8723D, value16);

	/* 2010.09.08 hpfan */
	/* Since ADF is removed from RCR, ps-poll will not be indicate to driver, */
	/* RxFilterMap should mask ps-poll to gurantee AP mode can rx ps-poll. */

	value16 = 0x400;
	rtw_write16(adapt, REG_RXFLTMAP1_8723D, value16);

	/* Accept all management frames */
	value16 = 0xFFFF;
	rtw_write16(adapt, REG_RXFLTMAP0_8723D, value16);

}

static void
_InitAdaptiveCtrl(
	struct adapter * adapt
)
{
	u16 value16;
	u32 value32;

	/* Response Rate Set */
	value32 = rtw_read32(adapt, REG_RRSR);
	value32 &= ~RATE_BITMAP_ALL;
	value32 |= RATE_RRSR_CCK_ONLY_1M;
	rtw_write32(adapt, REG_RRSR, value32);

	/* CF-END Threshold */
	/* m_spIoBase->rtw_write8(REG_CFEND_TH, 0x1); */

	/* SIFS (used in NAV) */
	value16 = _SPEC_SIFS_CCK(0x10) | _SPEC_SIFS_OFDM(0x10);
	rtw_write16(adapt, REG_SPEC_SIFS, value16);

	/* Retry Limit */
	value16 = _LRL(RL_VAL_STA) | _SRL(RL_VAL_STA);
	rtw_write16(adapt, REG_RL, value16);

}

static void
_InitEDCA(
	struct adapter * adapt
)
{
	/* Set Spec SIFS (used in NAV) */
	rtw_write16(adapt, REG_SPEC_SIFS, 0x100a);
	rtw_write16(adapt, REG_MAC_SPEC_SIFS, 0x100a);

	/* Set SIFS for CCK */
	rtw_write16(adapt, REG_SIFS_CTX, 0x100a);

	/* Set SIFS for OFDM */
	rtw_write16(adapt, REG_SIFS_TRX, 0x100a);

	/* TXOP */
	rtw_write32(adapt, REG_EDCA_BE_PARAM, 0x005EA42B);
	rtw_write32(adapt, REG_EDCA_BK_PARAM, 0x0000A44F);
	rtw_write32(adapt, REG_EDCA_VI_PARAM, 0x005EA324);
	rtw_write32(adapt, REG_EDCA_VO_PARAM, 0x002FA226);

}

static void _InitHWLed(struct adapter * adapt)
{
	struct led_priv *pledpriv = &(adapt->ledpriv);

	if (pledpriv->LedStrategy != HW_LED)
		return;

	/* HW led control */
	/* to do .... */
	/* must consider cases of antenna diversity/ commbo card/solo card/mini card */

}

static void
_InitRDGSetting_8723du(
	struct adapter * adapt
)
{
	rtw_write8(adapt, REG_RD_CTRL_8723D, 0xFF);
	rtw_write16(adapt, REG_RD_NAV_NXT_8723D, 0x200);
	rtw_write8(adapt, REG_RD_RESP_PKT_TH_8723D, 0x05);
}

static void
_InitRetryFunction(
	struct adapter * adapt
)
{
	u8 value8;

	value8 = rtw_read8(adapt, REG_FWHW_TXQ_CTRL);
	value8 |= EN_AMPDU_RTY_NEW;
	rtw_write8(adapt, REG_FWHW_TXQ_CTRL, value8);

