lwfinger/rtl8723du/hal/usb_halinit.c
	/* Set ACK timeout */
	rtw_write8(adapt, REG_ACKTO, 0x40);
}

static void _InitBurstPktLen(struct adapter * adapt)
{
	struct hal_com_data * pHalData = GET_HAL_DATA(adapt);
	u8 tmp8;


	tmp8 = rtw_read8(adapt, REG_RXDMA_MODE_CTRL_8723D);
	tmp8 &= ~(BIT(4) | BIT(5));
	switch (pHalData->UsbBulkOutSize) {
	case USB_HIGH_SPEED_BULK_SIZE:
		tmp8 |= BIT(4); /* set burst pkt len=512B */
		break;
	case USB_FULL_SPEED_BULK_SIZE:
	default:
		tmp8 |= BIT(5); /* set burst pkt len=64B */
		break;
	}
	tmp8 |= BIT(1) | BIT(2) | BIT(3);
	rtw_write8(adapt, REG_RXDMA_MODE_CTRL_8723D, tmp8);

	pHalData->bSupportUSB3 = false;

	tmp8 = rtw_read8(adapt, REG_HT_SINGLE_AMPDU_8723D);
	tmp8 |= BIT(7); /* enable single pkt ampdu */
	rtw_write8(adapt, REG_HT_SINGLE_AMPDU_8723D, tmp8);
	rtw_write16(adapt, REG_MAX_AGGR_NUM, 0x0C14);
	rtw_write8(adapt, REG_AMPDU_MAX_TIME_8723D, 0x5E);
	rtw_write32(adapt, REG_AMPDU_MAX_LENGTH_8723D, 0xffffffff);
	if (pHalData->AMPDUBurstMode)
		rtw_write8(adapt, REG_AMPDU_BURST_MODE_8723D, 0x5F);

	/* for VHT packet length 11K */
	rtw_write8(adapt, REG_RX_PKT_LIMIT, 0x18);

	rtw_write8(adapt, REG_PIFS, 0x00);
	rtw_write8(adapt, REG_FWHW_TXQ_CTRL, 0x80);
	rtw_write32(adapt, REG_FAST_EDCA_CTRL, 0x03086666);

	/* to prevent mac is reseted by bus. 20111208, by Page */
	tmp8 = rtw_read8(adapt, REG_RSV_CTRL);
	tmp8 |= BIT(5) | BIT(6);
	rtw_write8(adapt, REG_RSV_CTRL, tmp8);
}

/*-----------------------------------------------------------------------------
 * Function:	usb_AggSettingTxUpdate()
 *
 * Overview:	Separate TX/RX parameters update independent for TP detection and
 *			dynamic TX/RX aggreagtion parameters update.
 *
 * Input:			struct adapter *
 *
 * Output/Return:	NONE
 *
 * Revised History:
 *	When		Who		Remark
 *	12/10/2010	MHC		Separate to smaller function.
 *
 *---------------------------------------------------------------------------*/
static void
usb_AggSettingTxUpdate(
	struct adapter * adapt
)
{
}   /* usb_AggSettingTxUpdate */


/*-----------------------------------------------------------------------------
 * Function:	usb_AggSettingRxUpdate()
 *
 * Overview:	Separate TX/RX parameters update independent for TP detection and
 *			dynamic TX/RX aggreagtion parameters update.
 *
 * Input:			struct adapter *
 *
 * Output/Return:	NONE
 *
 *---------------------------------------------------------------------------*/
static void
usb_AggSettingRxUpdate(struct adapter * adapt)
{
	struct hal_com_data * pHalData;
	u8 aggctrl;
	u32 aggrx;
	u32 agg_size;

	pHalData = GET_HAL_DATA(adapt);

	aggctrl = rtw_read8(adapt, REG_TRXDMA_CTRL);
	aggctrl &= ~RXDMA_AGG_EN;

	aggrx = rtw_read32(adapt, REG_RXDMA_AGG_PG_TH);
	aggrx &= ~BIT_USB_RXDMA_AGG_EN;
	aggrx &= ~0xFF0F; /* reset agg size and timeout */

	rtw_write8(adapt, REG_TRXDMA_CTRL, aggctrl);
	rtw_write32(adapt, REG_RXDMA_AGG_PG_TH, aggrx);
}

static void _initUsbAggregationSetting(struct adapter * adapt)
{
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);

	/* Tx aggregation setting */
	usb_AggSettingTxUpdate(adapt);

	/* Rx aggregation setting */
	usb_AggSettingRxUpdate(adapt);

	/* 201/12/10 MH Add for USB agg mode dynamic switch. */
	pHalData->UsbRxHighSpeedMode = false;
}

static void PHY_InitAntennaSelection8723D(struct adapter * adapt)
{
}

static void _InitRFType(struct adapter * Adapter)
{
	struct registry_priv *pregpriv = &Adapter->registrypriv;
	struct hal_com_data *pHalData = GET_HAL_DATA(Adapter);

#if	DISABLE_BB_RF
	pHalData->rf_chip = RF_PSEUDO_11N;
	pHalData->rf_type = RF_1T1R;
	return;
#endif

	pHalData->rf_chip = RF_6052;
	pHalData->rf_type = RF_1T1R;

	RTW_INFO("Set RF Chip ID to RF_6052 and RF type to %d.\n", pHalData->rf_type);
}

/* Set CCK and OFDM Block "ON" */
static void _BBTurnOnBlock(struct adapter * adapt)
{
#if (DISABLE_BB_RF)
	return;
#endif

	phy_set_bb_reg(adapt, rFPGA0_RFMOD, bCCKEn, 0x1);
	phy_set_bb_reg(adapt, rFPGA0_RFMOD, bOFDMEn, 0x1);
}

#define MgntActSet_RF_State(...)

enum {
	Antenna_Lfet = 1,
	Antenna_Right = 2,
};

/* 2010/08/09 MH Add for power down check. */
static bool
HalDetectPwrDownMode(
	struct adapter * adapt
)
{
	u8 tmpvalue;
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);
	struct pwrctrl_priv *pwrctrlpriv = adapter_to_pwrctl(adapt);

	EFUSE_ShadowRead(adapt, 1, EEPROM_FEATURE_OPTION_8723D, (u32 *)&tmpvalue);

	if (tmpvalue & BIT(4) && pwrctrlpriv->reg_pdnmode)
		pHalData->pwrdown = true;
	else
		pHalData->pwrdown = false;

	RTW_INFO("%s(): PDN=%d\n", __func__, pHalData->pwrdown);
	return pHalData->pwrdown;
}   /* HalDetectPwrDownMode */


/*
 * 2010/08/26 MH Add for selective suspend mode check.
 * If Efuse 0x0e bit1 is not enabled, we can not support selective suspend for Minicard and
 * slim card.
 */
static void
HalDetectSelectiveSuspendMode(
	struct adapter * adapt
)
{
}   /* HalDetectSelectiveSuspendMode */

/*-----------------------------------------------------------------------------
 * Function:	HwSuspendModeEnable()
 *
 * Overview:	HW suspend mode switch.
 *
 * Input:		NONE
 *
 * Output:	NONE
 *
 * Return:	NONE
 *
 * Revised History:
 *	When		Who		Remark
 *	08/23/2010	MHC		HW suspend mode switch test..
 *---------------------------------------------------------------------------*/
static void HwSuspendModeEnable(struct adapter * adapt, u8 Type)
{
}

static enum rt_rf_power_state RfOnOffDetect(struct adapter * adapt)
{
	/* struct hal_com_data *pHalData = GET_HAL_DATA(adapt); */
	u8 val8;
	enum rt_rf_power_state rfpowerstate = rf_off;

	if (adapter_to_pwrctl(adapt)->bHWPowerdown) {
		val8 = rtw_read8(adapt, REG_HSISR);
		RTW_INFO("pwrdown, 0x5c(BIT(7))=%02x\n", val8);
		rfpowerstate = (val8 & BIT(7)) ? rf_off : rf_on;
	} else { /* rf on/off */
		rtw_write8(adapt, REG_MAC_PINMUX_CFG, rtw_read8(adapt, REG_MAC_PINMUX_CFG) & ~(BIT(3)));
		val8 = rtw_read8(adapt, REG_GPIO_IO_SEL);
		RTW_INFO("GPIO_IN=%02x\n", val8);
		rfpowerstate = (val8 & BIT(3)) ? rf_on : rf_off;
	}
	return rfpowerstate;
}   /* HalDetectPwrDownMode */

static void _InitBBRegBackup_8723du(struct adapter * adapt)
{
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);

	/* For Channel 1~11 (Default Value)*/
	pHalData->RegForRecover[0].offset = rCCK0_TxFilter2;
	pHalData->RegForRecover[0].value =
		phy_query_bb_reg(adapt,
			       pHalData->RegForRecover[0].offset, bMaskDWord);

	pHalData->RegForRecover[1].offset = rCCK0_DebugPort;
	pHalData->RegForRecover[1].value =
		phy_query_bb_reg(adapt,
			       pHalData->RegForRecover[1].offset, bMaskDWord);

	pHalData->RegForRecover[2].offset = 0xAAC;
	pHalData->RegForRecover[2].value =
		phy_query_bb_reg(adapt,
			       pHalData->RegForRecover[2].offset, bMaskDWord);
}

static u32 rtl8723du_hal_init(struct adapter * adapt)
{
	u8 value8 = 0, u1bRegCR;
	u32 status = _SUCCESS;
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);
	struct pwrctrl_priv *pwrctrlpriv = adapter_to_pwrctl(adapt);
	struct registry_priv *pregistrypriv = &adapt->registrypriv;
	enum rt_rf_power_state eRfPowerStateToSet;
	u32 NavUpper = WiFiNavUpperUs;
	u32 value32;
	unsigned long init_start_time = rtw_get_current_time();


	/* if (rtw_is_surprise_removed(adapt)) */
	/*	return RT_STATUS_FAILURE; */

	/* Check if MAC has already power on. */
	/* set usb timeout to fix read mac register fail before power on */
	rtw_write8(adapt, 0xFE4C /*REG_USB_ACCESS_TIMEOUT*/, 0x80);
	value8 = rtw_read8(adapt, REG_SYS_CLKR_8723D + 1);
	u1bRegCR = rtw_read8(adapt, REG_CR);
	RTW_INFO(" power-on :REG_SYS_CLKR 0x09=0x%02x. REG_CR 0x100=0x%02x.\n", value8, u1bRegCR);
	if ((value8 & BIT(3)) && (u1bRegCR != 0 && u1bRegCR != 0xEA))
		RTW_INFO(" MAC has already power on.\n");
	else {
		/* Set FwPSState to ALL_ON mode to prevent from the I/O be return because of 32k */
		/* state which is set before sleep under wowlan mode. 2012.01.04. by tynli. */
		RTW_INFO(" MAC has not been powered on yet.\n");
	}

