lwfinger/rtl8723du/hal/usb_halinit.c
	status = rtw_hal_power_on(adapt);
	if (status == _FAIL) {
		goto exit;
	}

	status = rtl8723d_InitLLTTable(adapt);
	if (status == _FAIL) {
		goto exit;
	}

	if (pHalData->bRDGEnable)
		_InitRDGSetting_8723du(adapt);


	/* Enable TX Report */
	/* Enable Tx Report Timer */
	value8 = rtw_read8(adapt, REG_TX_RPT_CTRL);
	rtw_write8(adapt, REG_TX_RPT_CTRL, value8 | BIT(1));
	/* Set MAX RPT MACID */
	rtw_write8(adapt, REG_TX_RPT_CTRL + 1, 2);
	/* Tx RPT Timer. Unit: 32us */
	rtw_write16(adapt, REG_TX_RPT_TIME, 0xCdf0);
	rtw_write8(adapt, REG_EARLY_MODE_CONTROL_8723D, 0);

	if (adapt->registrypriv.mp_mode == 0) {
		status = rtl8723d_FirmwareDownload(adapt, false);
		if (status != _SUCCESS) {
			pHalData->bFWReady = false;
			pHalData->fw_ractrl = false;
			goto exit;
		} else {
			pHalData->bFWReady = true;
			pHalData->fw_ractrl = true;
		}
	}

	if (pwrctrlpriv->reg_rfoff)
		pwrctrlpriv->rf_pwrstate = rf_off;

	/* Set RF type for BB/RF configuration */
	_InitRFType(adapt);

	HalDetectPwrDownMode(adapt);

	/* We should call the function before MAC/BB configuration. */
	PHY_InitAntennaSelection8723D(adapt);


#if (DISABLE_BB_RF == 1)
	/* fpga verification to open phy */
	rtw_write8(adapt, REG_SYS_FUNC_EN_8723D, FEN_USBA | FEN_USBD | FEN_BB_GLB_RSTn | FEN_BBRSTB);
#endif

#if (HAL_MAC_ENABLE == 1)
	status = PHY_MACConfig8723D(adapt);
	if (status == _FAIL) {
		RTW_INFO("PHY_MACConfig8723D fault !!\n");
		goto exit;
	}
#endif

	/* d. Initialize BB related configurations. */
#if (HAL_BB_ENABLE == 1)
	status = PHY_BBConfig8723D(adapt);
	if (status == _FAIL) {
		RTW_INFO("PHY_BBConfig8723D fault !!\n");
		goto exit;
	}
#endif

#if (HAL_RF_ENABLE == 1)
	status = PHY_RFConfig8723D(adapt);

	if (status == _FAIL) {
		RTW_INFO("PHY_RFConfig8723D fault !!\n");
		goto exit;
	}
	/*---- Set CCK and OFDM Block "ON"----*/
	phy_set_bb_reg(adapt, rFPGA0_RFMOD, bCCKEn, 0x1);
	phy_set_bb_reg(adapt, rFPGA0_RFMOD, bOFDMEn, 0x1);
#endif

	_InitBBRegBackup_8723du(adapt);

	_InitMacAPLLSetting_8723D(adapt);

	_InitQueueReservedPage(adapt);
	_InitTRxBufferBoundary(adapt);
	_InitQueuePriority(adapt);
	_InitTransferPageSize_8723du(adapt);


	/* Get Rx PHY status in order to report RSSI and others. */
	_InitDriverInfoSize(adapt, DRVINFO_SZ);

	_InitInterrupt(adapt);
	_InitNetworkType(adapt); /* set msr */
	_InitWMACSetting(adapt);
	_InitAdaptiveCtrl(adapt);
	_InitEDCA(adapt);
	_InitRetryFunction(adapt);
	/* _InitOperationMode(adapt);*/ /*todo */
	rtl8723d_InitBeaconParameters(adapt);
	rtl8723d_InitBeaconMaxError(adapt, true);

	_InitBurstPktLen(adapt);
	_initUsbAggregationSetting(adapt);

	_InitHardwareDropIncorrectBulkOut(adapt);

	rtw_write16(adapt, REG_PKT_VO_VI_LIFE_TIME, 0x0400); /* unit: 256us. 256ms */
	rtw_write16(adapt, REG_PKT_BE_BK_LIFE_TIME, 0x0400); /* unit: 256us. 256ms */
	_InitHWLed(adapt);

	_BBTurnOnBlock(adapt);

	rtw_hal_set_chnl_bw(adapt, adapt->registrypriv.channel,
		CHANNEL_WIDTH_20, HAL_PRIME_CHNL_OFFSET_DONT_CARE, HAL_PRIME_CHNL_OFFSET_DONT_CARE);

	invalidate_cam_all(adapt);

	rtl8723d_InitAntenna_Selection(adapt);

	/* HW SEQ CTRL */
	/* set 0x0 to 0xFF by tynli. Default enable HW SEQ NUM. */
	rtw_write8(adapt, REG_HWSEQ_CTRL, 0xFF);

	/*
	 * Disable BAR, suggested by Scott
	 * 2010.04.09 add by hpfan
	 */
	rtw_write32(adapt, REG_BAR_MODE_CTRL, 0x0201ffff);

	if (pregistrypriv->wifi_spec)
		rtw_write16(adapt, REG_FAST_EDCA_CTRL, 0);

	rtl8723d_InitHalDm(adapt);

#if (MP_DRIVER == 1)
	if (adapt->registrypriv.mp_mode == 1) {
		adapt->mppriv.channel = pHalData->current_channel;
		MPT_InitializeAdapter(adapt, adapt->mppriv.channel);
	} else
#endif
	{
		pwrctrlpriv->rf_pwrstate = rf_on;

		if (pwrctrlpriv->rf_pwrstate == rf_on) {
			struct pwrctrl_priv *pwrpriv;
			unsigned long start_time;
			u8 restore_iqk_rst;
			u8 b2Ant;
			u8 h2cCmdBuf;

			pwrpriv = adapter_to_pwrctl(adapt);

			/*phy_lc_calibrate_8723d(&pHalData->odmpriv);*/
			halrf_lck_trigger(&pHalData->odmpriv);

			/* Inform WiFi FW that it is the beginning of IQK */
			h2cCmdBuf = 1;
			FillH2CCmd8723D(adapt, H2C_8723D_BT_WLAN_CALIBRATION, 1, &h2cCmdBuf);

			start_time = rtw_get_current_time();
			do {
				if (rtw_read8(adapt, 0x1e7) & 0x01)
					break;

				rtw_msleep_os(50);
			} while (rtw_get_passing_time_ms(start_time) <= 400);

			rtw_btcoex_IQKNotify(adapt, true);
			restore_iqk_rst = (pwrpriv->bips_processing) ? true : false;
			b2Ant = pHalData->EEPROMBluetoothAntNum == Ant_x2 ? true : false;
			halrf_iqk_trigger(&pHalData->odmpriv, false);
			/*phy_iq_calibrate_8723d(adapt, false);*/
			pHalData->bIQKInitialized = true;
			rtw_btcoex_IQKNotify(adapt, false);

			/* Inform WiFi FW that it is the finish of IQK */
			h2cCmdBuf = 0;
			FillH2CCmd8723D(adapt, H2C_8723D_BT_WLAN_CALIBRATION, 1, &h2cCmdBuf);

			odm_txpowertracking_check(&pHalData->odmpriv);
		}
	}

	/* Init BT hw config. */
	if (adapt->registrypriv.mp_mode == 1)
		rtw_btcoex_HAL_Initialize(adapt, true);
	else
		rtw_btcoex_HAL_Initialize(adapt, false);

	rtw_hal_set_hwreg(adapt, HW_VAR_NAV_UPPER, (u8 *)&NavUpper);

	/* ack for xmit mgmt frames. */
	rtw_write32(adapt, REG_FWHW_TXQ_CTRL, rtw_read32(adapt, REG_FWHW_TXQ_CTRL) | BIT(12));

	phy_set_bb_reg(adapt, rOFDM0_XAAGCCore1, bMaskByte0, 0x50);
	phy_set_bb_reg(adapt, rOFDM0_XAAGCCore1, bMaskByte0, 0x20);
	/* Enable MACTXEN/MACRXEN block */
	u1bRegCR = rtw_read8(adapt, REG_CR);
	u1bRegCR |= (MACTXEN | MACRXEN);
	rtw_write8(adapt, REG_CR, u1bRegCR);

	if (adapt->registrypriv.wifi_spec == 1)
		phy_set_bb_reg(adapt, rOFDM0_ECCAThreshold,
			       0x00ff00ff, 0x00250029);

exit:

	RTW_INFO("%s in %dms\n", __func__, rtw_get_passing_time_ms(init_start_time));


	return status;
}

static void _DisableGPIO(struct adapter * adapt)
{
	/*
	 * j. GPIO_PIN_CTRL 0x44[31:0]=0x000
	 * k. Value = GPIO_PIN_CTRL[7:0]
	 * l. GPIO_PIN_CTRL 0x44[31:0] = 0x00FF0000 | (value <<8); write external Plevel
	 * m. GPIO_MUXCFG 0x42 [15:0] = 0x0780
	 * n. LEDCFG 0x4C[15:0] = 0x8080
	 */
	u8 value8;
	u16 value16;
	u32 value32;

	/* 1. Disable GPIO[7:0] */
	rtw_write16(adapt, REG_GPIO_PIN_CTRL + 2, 0x0000);
	value32 = rtw_read32(adapt, REG_GPIO_PIN_CTRL) & 0xFFFF00FF;
	value8 = (u8)(value32 & 0x000000FF);
	value32 |= ((value8 << 8) | 0x00FF0000);
	rtw_write32(adapt, REG_GPIO_PIN_CTRL, value32);

	/* 2. Disable GPIO[10:8] */
	rtw_write8(adapt, REG_GPIO_MUXCFG + 3, 0x00);
	value16 = rtw_read16(adapt, REG_GPIO_MUXCFG + 2) & 0xFF0F;
	value8 = (u8)(value16 & 0x000F);
	value16 |= ((value8 << 4) | 0x0780);
	rtw_write16(adapt, REG_GPIO_MUXCFG + 2, value16);

	/* 3. Disable LED0 & 1 */
	rtw_write16(adapt, REG_LEDCFG0, 0x8080);
} /* end of _DisableGPIO() */

static void
_ResetFWDownloadRegister(
	struct adapter * adapt
)
{
	u32 value32;

