lwfinger/rtl8723du/hal/usb_halinit.c
		value8 = rtw_read8(adapt, REG_LDOV12D_CTRL);
		value8 &= (~LDV12_EN);
		rtw_write8(adapt, REG_LDOV12D_CTRL, value8);
	}

	/*
	 * h.	SPS0_CTRL 0x11[7:0] = 0x23			enter PFM mode
	 * i.	APS_FSMCO 0x04[15:0] = 0x4802		set USB suspend
	 */


	value8 = 0x23;

	rtw_write8(adapt, REG_SPS0_CTRL, value8);


	if (bWithoutHWSM) {
		/* 2010/08/31 According to Filen description, we need to use HW to shut down 8051 automatically. */
		/* Because suspend operation need the asistance of 8051 to wait for 3ms. */
		value16 |= (APDM_HOST | AFSM_HSUS | PFM_ALDN);
	} else
		value16 |= (APDM_HOST | AFSM_HSUS | PFM_ALDN);

	rtw_write16(adapt, REG_APS_FSMCO, value16); /* 0x4802 */

	rtw_write8(adapt, REG_RSV_CTRL, 0x0e);
}

static void rtl8723du_hw_power_down(struct adapter * adapt)
{
	u8 u1bTmp;

	RTW_INFO("PowerDownRTL8723U\n");


	/* 1. Run Card Disable Flow */
	/* Done before this function call. */

	/* 2. 0x04[16] = 0 */   /* reset WLON */
	u1bTmp = rtw_read8(adapt, REG_APS_FSMCO + 2);
	rtw_write8(adapt, REG_APS_FSMCO + 2, (u1bTmp & (~BIT(0))));

	/* 3. 0x04[12:11] = 2b'11 */ /* enable suspend */
	/* Done before this function call. */

	/* 4. 0x04[15] = 1 */ /* enable PDN */
	u1bTmp = rtw_read8(adapt, REG_APS_FSMCO + 1);
	rtw_write8(adapt, REG_APS_FSMCO + 1, (u1bTmp | BIT(7)));
}

/*
 * Description: RTL8723e card disable power sequence v003 which suggested by Scott.
 * First created by tynli. 2011.01.28.
 */
static void
CardDisableRTL8723du(
	struct adapter * adapt
)
{
	u8 u1bTmp;

	rtw_hal_get_hwreg(adapt, HW_VAR_APFM_ON_MAC, &u1bTmp);
	RTW_INFO(FUNC_ADPT_FMT ": bMacPwrCtrlOn=%d\n", FUNC_ADPT_ARG(adapt), u1bTmp);
	if (!u1bTmp)
		return;
	u1bTmp = false;
	rtw_hal_set_hwreg(adapt, HW_VAR_APFM_ON_MAC, &u1bTmp);

	/* Stop Tx Report Timer. 0x4EC[Bit1]=b'0 */
	u1bTmp = rtw_read8(adapt, REG_TX_RPT_CTRL);
	rtw_write8(adapt, REG_TX_RPT_CTRL, u1bTmp & (~BIT(1)));

	/* stop rx */
	rtw_write8(adapt, REG_CR, 0x0);

	/* 1. Run LPS WL RFOFF flow */
	HalPwrSeqCmdParsing(adapt, PWR_CUT_ALL_MSK, PWR_FAB_ALL_MSK, PWR_INTF_USB_MSK, rtl8723D_enter_lps_flow);

	if ((rtw_read8(adapt, REG_MCUFWDL_8723D) & BIT(7)) &&
	    GET_HAL_DATA(adapt)->bFWReady) /*8051 RAM code */
		rtl8723d_FirmwareSelfReset(adapt);

	/* Reset MCU. Suggested by Filen. 2011.01.26. by tynli. */
	u1bTmp = rtw_read8(adapt, REG_SYS_FUNC_EN_8723D + 1);
	rtw_write8(adapt, REG_SYS_FUNC_EN_8723D + 1, (u1bTmp & (~BIT(2))));

	/* MCUFWDL 0x80[1:0]=0 */   /* reset MCU ready status */
	rtw_write8(adapt, REG_MCUFWDL_8723D, 0x00);

	/* Card disable power action flow */
	HalPwrSeqCmdParsing(adapt, PWR_CUT_ALL_MSK, PWR_FAB_ALL_MSK, PWR_INTF_USB_MSK, rtl8723D_card_disable_flow);

	GET_HAL_DATA(adapt)->bFWReady = false;
}


static u32 rtl8723du_hal_deinit(struct adapter * adapt)
{
	struct hal_com_data * pHalData = GET_HAL_DATA(adapt);
	struct pwrctrl_priv *pwrctl = adapter_to_pwrctl(adapt);

	RTW_INFO("==> %s\n", __func__);

	rtw_write16(adapt, REG_GPIO_MUXCFG, rtw_read16(adapt, REG_GPIO_MUXCFG) & (~BIT(12)));

	rtw_write32(adapt, REG_HISR0_8723D, 0xFFFFFFFF);
	rtw_write32(adapt, REG_HISR1_8723D, 0xFFFFFFFF);
#ifdef SUPPORT_HW_RFOFF_DETECTED
	RTW_INFO("%s: bkeepfwalive(%x)\n", __func__, pwrctl->bkeepfwalive);

	if (pwrctl->bkeepfwalive) {
		_ps_close_RF(Adapter);
		if ((pwrctl->bHWPwrPindetect) && (pwrctl->bHWPowerdown))
			rtl8723du_hw_power_down(adapt);
	} else
#endif
	{
		if (rtw_is_hw_init_completed(adapt)) {
			rtw_hal_power_off(adapt);

			if ((pwrctl->bHWPwrPindetect) && (pwrctl->bHWPowerdown))
				rtl8723du_hw_power_down(adapt);
		}
		pHalData->bMacPwrCtrlOn = false;
	}
	return _SUCCESS;
}


static unsigned int rtl8723du_inirp_init(struct adapter * adapt)
{
	u8 i;
	struct recv_buf *precvbuf;
	uint status;
	struct dvobj_priv *pdev = adapter_to_dvobj(adapt);
	struct intf_hdl *pintfhdl = &adapt->iopriv.intf;
	struct recv_priv *precvpriv = &(adapt->recvpriv);
	u32(*_read_port)(struct intf_hdl *pintfhdl, u32 addr, u32 cnt, u8 *pmem);

	_read_port = pintfhdl->io_ops._read_port;

	status = _SUCCESS;


	precvpriv->ff_hwaddr = RECV_BULK_IN_ADDR;

	/* issue Rx irp to receive data */
	precvbuf = (struct recv_buf *)precvpriv->precv_buf;
	for (i = 0; i < NR_RECVBUFF; i++) {
		if (!_read_port(pintfhdl, precvpriv->ff_hwaddr, 0, (unsigned char *)precvbuf)) {
			status = _FAIL;
			goto exit;
		}

		precvbuf++;
		precvpriv->free_recv_buf_queue_cnt--;
	}

exit:



	return status;

}

static unsigned int rtl8723du_inirp_deinit(struct adapter * adapt)
{
	rtw_read_port_cancel(adapt);
	return _SUCCESS;
}

static u32 _GetChannelGroup(u32 channel)
{
	if (channel < 3)    /* Channel 1~3 */
		return 0;
	else if (channel < 9)   /* Channel 4~9 */
		return 1;

	return 2;               /* Channel 10~14 */
}

/*
 *-------------------------------------------------------------------
 *	EEPROM/EFUSE Content Parsing
 *-------------------------------------------------------------------
 */
static void
hal_EfuseParseLEDSetting(
	struct adapter * adapt,
	u8 *PROMContent,
	bool AutoloadFail
)
{
}

static void
hal_EfuseParseRFSetting(
	struct adapter * adapt,
	u8 *PROMContent,
	bool AutoloadFail
)
{
}

/* Read HW power down mode selection */
static void
hal_EfuseParsePowerSavingSetting(
	struct adapter * adapt,
	u8 *PROMContent,
	u8 AutoloadFail
)
{
	struct pwrctrl_priv *pwrctl = adapter_to_pwrctl(adapt);

	if (AutoloadFail) {
		pwrctl->bHWPowerdown = false;
		pwrctl->bSupportRemoteWakeup = false;
	} else {
		/*if(SUPPORT_HW_RADIO_DETECT(adapt)) */
		pwrctl->bHWPwrPindetect = adapt->registrypriv.hwpwrp_detect;
		/*else */
		/*pwrctl->bHWPwrPindetect = false; */ /*dongle not support new */


		/*hw power down mode selection , 0:rf-off / 1:power down */

		if (adapt->registrypriv.hwpdn_mode == 2)
			pwrctl->bHWPowerdown = (PROMContent[EEPROM_FEATURE_OPTION_8723D] & BIT(4));
		else
			pwrctl->bHWPowerdown = adapt->registrypriv.hwpdn_mode;

		/* decide hw if support remote wakeup function */
		/* if hw supported, 8051 (SIE) will generate WeakUP signal( D+/D- toggle) when autoresume */
		pwrctl->bSupportRemoteWakeup = (PROMContent[EEPROM_USB_OPTIONAL_FUNCTION0] & BIT(1)) ? true : false;

