lwfinger/rtl8723du/hal/usb_halinit.c
		/*if(SUPPORT_HW_RADIO_DETECT(adapt)) */
		/*adapt->registrypriv.usbss_enable = pwrctl->bSupportRemoteWakeup ; */

		RTW_INFO("%s...bHWPwrPindetect(%x)-bHWPowerdown(%x) ,bSupportRemoteWakeup(%x)\n", __func__,
			pwrctl->bHWPwrPindetect, pwrctl->bHWPowerdown, pwrctl->bSupportRemoteWakeup);

		RTW_INFO("### PS params=>  power_mgnt(%x),usbss_enable(%x) ###\n", adapt->registrypriv.power_mgnt, adapt->registrypriv.usbss_enable);

	}
}

static void
hal_EfuseParseIDs(
	struct adapter * adapt,
	u8 *hwinfo,
	bool AutoLoadFail
)
{
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);

	if (!AutoLoadFail) {
		/* VID, PID */
		pHalData->EEPROMVID = ReadLE2Byte(&hwinfo[EEPROM_VID_8723DU]);
		pHalData->EEPROMPID = ReadLE2Byte(&hwinfo[EEPROM_PID_8723DU]);

		/* Customer ID, 0x00 and 0xff are reserved for Realtek. */
		pHalData->EEPROMCustomerID = *(u8 *)&hwinfo[EEPROM_CustomID_8723D];
		pHalData->EEPROMSubCustomerID = EEPROM_Default_SubCustomerID;
	} else {
		pHalData->EEPROMVID = EEPROM_Default_VID;
		pHalData->EEPROMPID = EEPROM_Default_PID;

		/* Customer ID, 0x00 and 0xff are reserved for Realtek. */
		pHalData->EEPROMCustomerID = EEPROM_Default_CustomerID;
		pHalData->EEPROMSubCustomerID = EEPROM_Default_SubCustomerID;
	}

	if ((pHalData->EEPROMVID == EEPROM_Default_VID)
	    && (pHalData->EEPROMPID == EEPROM_Default_PID)) {
		pHalData->CustomerID = EEPROM_Default_CustomerID;
		pHalData->EEPROMSubCustomerID = EEPROM_Default_SubCustomerID;
	}

	RTW_INFO("VID = 0x%04X, PID = 0x%04X\n", pHalData->EEPROMVID, pHalData->EEPROMPID);
	RTW_INFO("Customer ID: 0x%02X, SubCustomer ID: 0x%02X\n", pHalData->EEPROMCustomerID, pHalData->EEPROMSubCustomerID);
}

static u8
InitadaptVariablesByPROM_8723du(
	struct adapter * adapt
)
{
	struct hal_com_data * pHalData = GET_HAL_DATA(adapt);
	u8 *hwinfo = NULL;
	u8 ret = _FAIL;

	if (sizeof(pHalData->efuse_eeprom_data) < HWSET_MAX_SIZE_8723D)
		RTW_INFO("[WARNING] size of efuse_eeprom_data is less than HWSET_MAX_SIZE_8723D!\n");

	hwinfo = pHalData->efuse_eeprom_data;

	Hal_InitPGData(adapt, hwinfo);
	Hal_EfuseParseIDCode(adapt, hwinfo);
	Hal_EfuseParseEEPROMVer_8723D(adapt, hwinfo, pHalData->bautoload_fail_flag);

	hal_EfuseParseIDs(adapt, hwinfo, pHalData->bautoload_fail_flag);
	hal_config_macaddr(adapt, pHalData->bautoload_fail_flag);
	hal_EfuseParsePowerSavingSetting(adapt, hwinfo, pHalData->bautoload_fail_flag);

	Hal_EfuseParseTxPowerInfo_8723D(adapt, hwinfo, pHalData->bautoload_fail_flag);
	Hal_EfuseParseBoardType_8723D(adapt, hwinfo, pHalData->bautoload_fail_flag);

	Hal_EfuseParseBTCoexistInfo_8723D(adapt, hwinfo, pHalData->bautoload_fail_flag);

	Hal_EfuseParseChnlPlan_8723D(adapt, hwinfo, pHalData->bautoload_fail_flag);
	Hal_EfuseParseXtal_8723D(adapt, hwinfo, pHalData->bautoload_fail_flag);
	Hal_EfuseParseThermalMeter_8723D(adapt, hwinfo, pHalData->bautoload_fail_flag);
	Hal_EfuseParseAntennaDiversity_8723D(adapt, hwinfo, pHalData->bautoload_fail_flag);
	Hal_EfuseParseCustomerID_8723D(adapt, hwinfo, pHalData->bautoload_fail_flag);

	hal_EfuseParseLEDSetting(adapt, hwinfo, pHalData->bautoload_fail_flag);

	/* set coex. ant info once efuse parsing is done */
	rtw_btcoex_set_ant_info(adapt);

	/* Hal_EfuseParseKFreeData_8723D(adapt, hwinfo, pHalData->bautoload_fail_flag); */
	if (hal_read_mac_hidden_rpt(adapt) != _SUCCESS)
		goto exit;
	ret = _SUCCESS;

exit:
	return ret;
}

static u8
hal_EfuseParsePROMContent(
	struct adapter * adapt
)
{
	struct hal_com_data * pHalData = GET_HAL_DATA(adapt);

	u8 eeValue;
	u32 i;
	u16 value16;
	u8 ret = _FAIL;

	eeValue = rtw_read8(adapt, REG_9346CR);
	/* To check system boot selection. */
	pHalData->EepromOrEfuse = (eeValue & BOOT_FROM_EEPROM) ? true : false;
	pHalData->bautoload_fail_flag = (eeValue & EEPROM_EN) ? false : true;

	RTW_INFO("Boot from %s, Autoload %s !\n", (pHalData->EepromOrEfuse ? "EEPROM" : "EFUSE"),
		 (pHalData->bautoload_fail_flag ? "Fail" : "OK"));

	if (InitadaptVariablesByPROM_8723du(adapt) != _SUCCESS)
		goto exit;

	ret = _SUCCESS;

exit:
	return ret;
}

static void
_ReadRFType(struct adapter * adapt)
{
	struct hal_com_data *pHalData = GET_HAL_DATA(adapt);

#if DISABLE_BB_RF
	pHalData->rf_chip = RF_PSEUDO_11N;
#else
	pHalData->rf_chip = RF_6052;
#endif
}

/*
 * Description:
 *    We should set Efuse cell selection to WiFi cell in default.
 * Assumption:
 *    PASSIVE_LEVEL
 */
static void
hal_EfuseCellSel(struct adapter * adapt)
{
	u32 value32;

	value32 = rtw_read32(adapt, EFUSE_TEST);
	value32 = (value32 & ~EFUSE_SEL_MASK) | EFUSE_SEL(EFUSE_WIFI_SEL_0);
	rtw_write32(adapt, EFUSE_TEST, value32);
}

static u8 rtl8723du_read_adapter_info(struct adapter * adapt)
{
	u8 ret = _FAIL;

	/* Read EEPROM size before call any EEPROM function */
	adapt->EepromAddressSize = GetEEPROMSize8723D(adapt);

	/* Efuse_InitSomeVar(adapt); */

	hal_EfuseCellSel(adapt);

	_ReadRFType(adapt);
	if (hal_EfuseParsePROMContent(adapt) != _SUCCESS)
		goto exit;

	ret = _SUCCESS;

exit:
	return ret;
}

#define GPIO_DEBUG_PORT_NUM 0
static void rtl8723du_trigger_gpio_0(struct adapter * adapt)
{

	u32 gpioctrl;

	RTW_INFO("==> trigger_gpio_0...\n");
	rtw_write16_async(adapt, REG_GPIO_PIN_CTRL, 0);
	rtw_write8_async(adapt, REG_GPIO_PIN_CTRL + 2, 0xFF);
	gpioctrl = (BIT(GPIO_DEBUG_PORT_NUM) << 24) | (BIT(GPIO_DEBUG_PORT_NUM) << 16);
	rtw_write32_async(adapt, REG_GPIO_PIN_CTRL, gpioctrl);
	gpioctrl |= (BIT(GPIO_DEBUG_PORT_NUM) << 8);
	rtw_write32_async(adapt, REG_GPIO_PIN_CTRL, gpioctrl);
	RTW_INFO("<=== trigger_gpio_0...\n");

}

/*
 * If variable not handled here,
 * some variables will be processed in SetHwReg8723A()
 */
static u8 SetHwReg8723du(struct adapter * adapt, u8 variable, u8 *val)
{
	struct hal_com_data * pHalData = GET_HAL_DATA(adapt);
	u8 ret = _SUCCESS;

	switch (variable) {
	case HW_VAR_RXDMA_AGG_PG_TH:
		break;
	case HW_VAR_SET_RPWM:
		rtw_write8(adapt, REG_USB_HRPWM, *val);
		break;
	case HW_VAR_TRIGGER_GPIO_0:
		rtl8723du_trigger_gpio_0(adapt);
		break;
	default:
		ret = SetHwReg8723D(adapt, variable, val);
		break;
	}
	return ret;
}

